app/controllers/songs_controller.rb

  def index
    #@songs = Song.all
    @songs = Song.order(title: :asc).page(params[:page])
---
SELECT  "songs".* FROM "songs"  ORDER BY "songs"."title" ASC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "songs" ORDER BY "songs"."created_at" DESC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 20], ["OFFSET", 0]]